We have scrapped the flight data from many popular websites between major cities for many days
Del-Mum
Mum-Del
Del-Banglore
Banglore-Delhi
Del-Goa
Goa-Del
Banglore-Kolkata
Kolkata-Banglore

In [1]:
# Import required libraries

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

In [28]:
# Load dataset
df=pd.read_csv('flight.csv', index_col=[0], parse_dates=['Booking_date','Journey_date'])

In [29]:
# Dataset random sample
df.sample(5)

,From,To,Booking_date,Journey_date,Airline,Code,Departure,Arrival,Duration,Stops,Price
2527,Delhi,Goa,2022-06-24,2022-06-28,Indigo,6E- 184,09:50,14:45,04h 55m,1-stop,"9,734"
5269,Mumbai,Delhi,2022-06-24,2022-06-27,Indigo,6E-5293,00:35,07:30,06h 55m,1-stop,"8,883"
6050,Kolkata,Bangalore,2022-06-24,2022-06-25,AirAsia,I5-319,13:15,01:20,12h 05m,1-stop,"11,426"
807,Delhi,Bangalore,2022-06-23,2022-06-29,Vistara,UK-871,20:35,08:45\n+1D,12h 10m,1 stop,"₹14,140"
3479,Goa,Delhi,2022-06-24,2022-06-29,Indigo,6E-6386,18:40,01:40,07h 00m,1-stop,"9,936"

In [30]:
df.shape

(7548, 11)

In [32]:
df.isnull().sum() # target feature have some Null values, so better to ignore those records

From               0
To                 0
Booking_date       0
Journey_date       0
Airline            0
Code               0
Departure          0
Arrival            0
Duration           0
Stops              0
Price           1486
dtype: int64

In [33]:
df.dropna(inplace=True)

In [34]:
df.shape

(6062, 11)

# Feature Preprocessing on features

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6062 entries, 0 to 7547
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From          6062 non-null   object
 1   To            6062 non-null   object
 2   Booking_date  6062 non-null   datetime64[ns]
 3   Journey_date  6062 non-null   datetime64[ns]
 4   Airline       6062 non-null   object
 5   Code          6062 non-null   object
 6   Departure     6062 non-null   object
 7   Arrival       6062 non-null   object
 8   Duration      6062 non-null   object
 9   Stops         6062 non-null   object
 10  Price         6062 non-null   object
dtypes: datetime64[ns](2), object(9)
memory usage: 568.3+ KB

In [36]:
df.head(2)

,From,To,Booking_date,Journey_date,Airline,Code,Departure,Arrival,Duration,Stops,Price
0,Delhi,Bangalore,2022-06-23,2022-06-23,Air India,AI-504,21:15,00:05\n+1D,2h 50m,non-stop,"₹9,420"
1,Delhi,Bangalore,2022-06-23,2022-06-23,IndiGo,6E-2131,21:30,00:15\n+1D,2h 45m,non-stop,"₹9,419"